stianeklund/msp430fr4133/msp430fr4133.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>USCI_A0_UART_MODE</name>
      <description>USCI_A0  UART Mode</description>
      <baseAddress>1280</baseAddress>
      <registers>
        <register>
          <name>UCA0CTL1</name>
          <description>USCI A0 Control Register 1</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0CTL0</name>
          <description>USCI A0 Control Register 0</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0BR0</name>
          <description>USCI A0 Baud Rate 0</description>
          <addressOffset>6</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0BR1</name>
          <description>USCI A0 Baud Rate 1</description>
          <addressOffset>7</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0STATW</name>
          <description>USCI A0 Status Register</description>
          <addressOffset>10</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCBUSY</name>
              <description>USCI Busy Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCADDR</name>
              <description>USCI Address received Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCRXERR</name>
              <description>USCI RX Error Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRK</name>
              <description>USCI Break received</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCPE</name>
              <description>USCI Parity Error Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCOE</name>
              <description>USCI Overrun Error Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCFE</name>
              <description>USCI Frame Error Flag</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCLISTEN</name>
              <description>USCI Listen mode</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>UCA0ABCTL</name>
          <description>USCI A0 LIN Control</description>
          <addressOffset>16</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>UCABDEN</name>
              <description>Auto Baud Rate detect enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBTOE</name>
              <description>Break Timeout error</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCSTOE</name>
              <description>Sync-Field Timeout error</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCDELIM0</name>
              <description>Break Sync Delimiter 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCDELIM1</name>
              <description>Break Sync Delimiter 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0IRTCTL</name>
          <description>USCI A0 IrDA Transmit Control</description>
          <addressOffset>18</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0IRRCTL</name>
          <description>USCI A0 IrDA Receive Control</description>
          <addressOffset>19</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>UCA0CTLW1</name>
          <description>USCI A0 Control Word Register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCGLIT</name>
              <description>USCI Deglitch Time Bit 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCGLIT_0</name>
                  <description>USCI Deglitch time: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_1</name>
                  <description>USCI Deglitch time: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_2</name>
                  <description>USCI Deglitch time: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCGLIT_3</name>
                  <description>USCI Deglitch time: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0MCTLW</name>
          <description>USCI A0 Modulation Control</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>UCOS16</name>
              <description>USCI 16-times Oversampling enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRF</name>
              <description>USCI First Stage Modulation Select 3</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UCBRF_0</name>
                  <description>USCI First Stage Modulation: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_1</name>
                  <description>USCI First Stage Modulation: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_2</name>
                  <description>USCI First Stage Modulation: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_3</name>
                  <description>USCI First Stage Modulation: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_4</name>
                  <description>USCI First Stage Modulation: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_5</name>
                  <description>USCI First Stage Modulation: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_6</name>
                  <description>USCI First Stage Modulation: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_7</name>
                  <description>USCI First Stage Modulation: 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_8</name>
                  <description>USCI First Stage Modulation: 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_9</name>
                  <description>USCI First Stage Modulation: 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_10</name>
                  <description>USCI First Stage Modulation: A</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_11</name>
                  <description>USCI First Stage Modulation: B</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_12</name>
                  <description>USCI First Stage Modulation: C</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_13</name>
                  <description>USCI First Stage Modulation: D</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_14</name>
                  <description>USCI First Stage Modulation: E</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UCBRF_15</name>
                  <description>USCI First Stage Modulation: F</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>UCBRS0</name>
              <description>USCI Second Stage Modulation Select 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRS1</name>
              <description>USCI Second Stage Modulation Select 1</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRS2</name>
              <description>USCI Second Stage Modulation Select 2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRS3</name>
              <description>USCI Second Stage Modulation Select 3</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRS4</name>
              <description>USCI Second Stage Modulation Select 4</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRS5</name>
              <description>USCI Second Stage Modulation Select 5</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRS6</name>
              <description>USCI Second Stage Modulation Select 6</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCBRS7</name>
              <description>USCI Second Stage Modulation Select 7</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCA0RXBUF</name>
          <description>USCI A0 Receive Buffer</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>UCA0TXBUF</name>
          <description>USCI A0 Transmit Buffer</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>UCA0IV</name>
          <description>USCI A0 Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
