stianeklund/msp430fr4133/msp430fr4133.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SYS</name>
      <description>SYS  System Module</description>
      <baseAddress>320</baseAddress>
      <registers>
        <register>
          <name>SYSCTL</name>
          <description>System control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSRIVECT</name>
              <description>SYS - RAM based interrupt vectors</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSPMMPE</name>
              <description>SYS - PMM access protect</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBSLIND</name>
              <description>SYS - TCK/RST indication detected</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSJTAGPIN</name>
              <description>SYS - Dedicated JTAG pins enabled</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSBSLC</name>
          <description>Boot strap configuration area</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSBSLR</name>
              <description>SYS - RAM assigned to BSL</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBSLOFF</name>
              <description>SYS - BSL Memory disabled</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYSBSLPE</name>
              <description>SYS - BSL Memory protection enabled</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBC</name>
          <description>JTAG mailbox control</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>JMBIN0FG</name>
              <description>SYS - Incoming JTAG Mailbox 0 Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBIN1FG</name>
              <description>SYS - Incoming JTAG Mailbox 1 Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBOUT0FG</name>
              <description>SYS - Outgoing JTAG Mailbox 0 Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBOUT1FG</name>
              <description>SYS - Outgoing JTAG Mailbox 1 Flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBMODE</name>
              <description>SYS - JMB 16/32 Bit Mode</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBCLR0OFF</name>
              <description>SYS - Incoming JTAG Mailbox 0 Flag auto-clear disalbe</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>JMBCLR1OFF</name>
              <description>SYS - Incoming JTAG Mailbox 1 Flag auto-clear disalbe</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSJMBI0</name>
          <description>JTAG mailbox input 0</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSJMBI1</name>
          <description>JTAG mailbox input 1</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSJMBO0</name>
          <description>JTAG mailbox output 0</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSJMBO1</name>
          <description>JTAG mailbox output 1</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSBERRIV</name>
          <description>Bus Error vector generator</description>
          <addressOffset>24</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSUNIV</name>
          <description>User NMI vector generator</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSSNIV</name>
          <description>System NMI vector generator</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>SYSRSTIV</name>
          <description>Reset Vector Generator</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SYSRSTIV</name>
              <description>Reset interrupt vector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>No interrupt pending</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BOR</name>
                  <description>Brownout</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RSTNMI</name>
                  <description>RSTIFG RST/NMI</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWBOR</name>
                  <description>PMMSWBOR software BOR</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LPM5WU</name>
                  <description>LPMx.5 wakeup</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SECYV</name>
                  <description>Security violation</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_12</name>
                  <description>Reserved</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SVSHIFG</name>
                  <description>SVSHIFG SVSH event</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_16</name>
                  <description>Reserved</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_18</name>
                  <description>Reserved</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMSWPOR</name>
                  <description>PMMSWPOR software POR</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIFG</name>
                  <description>WDTIFG watchdog timeout</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTPW</name>
                  <description>WDTPW watchdog password violation</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FRCTLPW</name>
                  <description>FRCTLPW password violation</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UBDIFG</name>
                  <description>Uncorrectable FRAM bit error detection</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PERF</name>
                  <description>Peripheral area fetch</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PMMPW</name>
                  <description>PMM password violation</description>
                  <value>32</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SYSRSTIV_34</name>
                  <description>Reserved</description>
                  <value>34</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUL</name>
                  <description>FLL unlock (PUC)</description>
                  <value>36</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG0</name>
          <description>System Configuration 0</description>
          <addressOffset>32</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>PFWP</name>
              <description>Program FRAM Write Protection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DFWP</name>
              <description>Data FRAM Write Protection</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRWPPW</name>
              <description>FRAM protection password. Write with 0A5h to unlock the FRAM protection registers. Always reads as 096h</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>FRWPOA</name>
              <description>Program FRAM write protection offsett address from the beginning of Program FRAM. The offset increases by 1KB resolution</description>
              <bitOffset>2</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>63</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG1</name>
          <description>System Configuration 1</description>
          <addressOffset>34</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>IREN</name>
              <description>Infrared enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRPSEL</name>
              <description>Infrared polarity select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRMSEL</name>
              <description>Infrared mode select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDSSEL</name>
              <description>Infrared data source select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>IRDATA</name>
              <description>Infrared enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSCFG2</name>
          <description>System Configuration 2</description>
          <addressOffset>36</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCPCTL0</name>
              <description>ADC input A0 pin select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPCTL1</name>
              <description>ADC input A1 pin select</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPCTL2</name>
              <description>ADC input A2 pin select</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPCTL3</name>
              <description>ADC input A3 pin select</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPCTL4</name>
              <description>ADC input A4 pin select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPCTL5</name>
              <description>ADC input A5 pin select</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPCTL6</name>
              <description>ADC input A6 pin select</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPCTL7</name>
              <description>ADC input A7 pin select</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPCTL8</name>
              <description>ADC input A8 pin select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCPCTL9</name>
              <description>ADC input A9 pin select</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDPCTL</name>
              <description>LCD Power Pin</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
