stianeklund/msp430fr4133/msp430fr4133.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CS</name>
      <description>CS  Clock System</description>
      <baseAddress>384</baseAddress>
      <registers>
        <register>
          <name>CSCTL0</name>
          <description>CS Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DCO0</name>
              <description>DCO TAP Bit : 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO1</name>
              <description>DCO TAP Bit : 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO2</name>
              <description>DCO TAP Bit : 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO3</name>
              <description>DCO TAP Bit : 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO4</name>
              <description>DCO TAP Bit : 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO5</name>
              <description>DCO TAP Bit : 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO6</name>
              <description>DCO TAP Bit : 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO7</name>
              <description>DCO TAP Bit : 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCO8</name>
              <description>DCO TAP Bit : 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD0</name>
              <description>Modulation Bit Counter Bit : 0</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD1</name>
              <description>Modulation Bit Counter Bit : 1</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD2</name>
              <description>Modulation Bit Counter Bit : 2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD3</name>
              <description>Modulation Bit Counter Bit : 3</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD4</name>
              <description>Modulation Bit Counter Bit : 4</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL1</name>
          <description>CS Control Register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DISMOD</name>
              <description>Disable Modulation</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DCORSEL</name>
              <description>DCO frequency range select Bit: 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCORSEL_0</name>
                  <description>DCO frequency range select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_1</name>
                  <description>DCO frequency range select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_2</name>
                  <description>DCO frequency range select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_3</name>
                  <description>DCO frequency range select: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_4</name>
                  <description>DCO frequency range select: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_5</name>
                  <description>DCO frequency range select: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_6</name>
                  <description>DCO frequency range select: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCORSEL_7</name>
                  <description>DCO frequency range select: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOFTRIM</name>
              <description>DCO frequency trim. Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DCOFTRIM_0</name>
                  <description>DCO frequency trim: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFTRIM_1</name>
                  <description>DCO frequency trim: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFTRIM_2</name>
                  <description>DCO frequency trim: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFTRIM_3</name>
                  <description>DCO frequency trim: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFTRIM_4</name>
                  <description>DCO frequency trim: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFTRIM_5</name>
                  <description>DCO frequency trim: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFTRIM_6</name>
                  <description>DCO frequency trim: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DCOFTRIM_7</name>
                  <description>DCO frequency trim: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DCOFTRIMEN</name>
              <description>DCO frequency trim enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL2</name>
          <description>CS Control Register 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>FLLN0</name>
              <description>FLL Multipier Bit : 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN1</name>
              <description>FLL Multipier Bit : 1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN2</name>
              <description>FLL Multipier Bit : 2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN3</name>
              <description>FLL Multipier Bit : 3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN4</name>
              <description>FLL Multipier Bit : 4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN5</name>
              <description>FLL Multipier Bit : 5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN6</name>
              <description>FLL Multipier Bit : 6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN7</name>
              <description>FLL Multipier Bit : 7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN8</name>
              <description>FLL Multipier Bit : 8</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLN9</name>
              <description>FLL Multipier Bit : 9</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLD</name>
              <description>Loop Divider Bit : 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLD_0</name>
                  <description>Multiply Selected Loop Freq. By 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_1</name>
                  <description>Multiply Selected Loop Freq. By 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_2</name>
                  <description>Multiply Selected Loop Freq. By 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_3</name>
                  <description>Multiply Selected Loop Freq. By 8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_4</name>
                  <description>Multiply Selected Loop Freq. By 16</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_5</name>
                  <description>Multiply Selected Loop Freq. By 32</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_6</name>
                  <description>Reserved</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLD_7</name>
                  <description>Reserved</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL3</name>
          <description>CS Control Register 3</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>FLLREFDIV</name>
              <description>Reference Divider Bit : 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLREFDIV_0</name>
                  <description>Reference Divider: f(LFCLK)/1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_1</name>
                  <description>Reference Divider: f(LFCLK)/2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_2</name>
                  <description>Reference Divider: f(LFCLK)/4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_3</name>
                  <description>Reference Divider: f(LFCLK)/8</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_4</name>
                  <description>Reference Divider: f(LFCLK)/12</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_5</name>
                  <description>Reference Divider: f(LFCLK)/16</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_6</name>
                  <description>Reference Divider: f(LFCLK)/16</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLREFDIV_7</name>
                  <description>Reference Divider: f(LFCLK)/16</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELREF</name>
              <description>FLL Reference Clock Select Bit : 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELREF_0</name>
                  <description>FLL Reference Clock Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_1</name>
                  <description>FLL Reference Clock Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_2</name>
                  <description>FLL Reference Clock Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELREF_3</name>
                  <description>FLL Reference Clock Select 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL4</name>
          <description>CS Control Register 4</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>SELMS</name>
              <description>MCLK and SMCLK Source Select Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SELMS_0</name>
                  <description>MCLK and SMCLK Source Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_1</name>
                  <description>MCLK and SMCLK Source Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_2</name>
                  <description>MCLK and SMCLK Source Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_3</name>
                  <description>MCLK and SMCLK Source Select 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_4</name>
                  <description>MCLK and SMCLK Source Select 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_5</name>
                  <description>MCLK and SMCLK Source Select 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_6</name>
                  <description>MCLK and SMCLK Source Select 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SELMS_7</name>
                  <description>MCLK and SMCLK Source Select 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SELA</name>
              <description>ACLK Source Select Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL5</name>
          <description>CS Control Register 5</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DIVM</name>
              <description>MCLK Divider Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVM_0</name>
                  <description>MCLK Source Divider 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_1</name>
                  <description>MCLK Source Divider 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_2</name>
                  <description>MCLK Source Divider 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_3</name>
                  <description>MCLK Source Divider 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_4</name>
                  <description>MCLK Source Divider 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_5</name>
                  <description>MCLK Source Divider 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_6</name>
                  <description>MCLK Source Divider 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVM_7</name>
                  <description>MCLK Source Divider 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVS</name>
              <description>SMCLK Divider Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DIVS_0</name>
                  <description>SMCLK Source Divider 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_1</name>
                  <description>SMCLK Source Divider 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_2</name>
                  <description>SMCLK Source Divider 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DIVS_3</name>
                  <description>SMCLK Source Divider 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SMCLKOFF</name>
              <description>SMCLK off</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VLOAUTOOFF</name>
              <description>VLO automatic off enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
