stianeklund/msp430fr4133/msp430fr4133.svd
        <register>
          <name>CSCTL6</name>
          <description>CS Control Register 6</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>XT1AUTOOFF</name>
              <description>XT1 automatic off enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT1AGCOFF</name>
              <description>XT1 Automatic Gain Control (AGC) disable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT1BYPASS</name>
              <description>XT1 bypass mode : 0: internal 1:sourced from external pin</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XTS</name>
              <description>1: Selects high-freq. oscillator</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT1DRIVE</name>
              <description>XT1 Drive Level mode Bit 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>XT1DRIVE_0</name>
                  <description>XT1 Drive Level mode: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_1</name>
                  <description>XT1 Drive Level mode: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_2</name>
                  <description>XT1 Drive Level mode: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>XT1DRIVE_3</name>
                  <description>XT1 Drive Level mode: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL7</name>
          <description>CS Control Register 7</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>DCOFFG</name>
              <description>DCO fault flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XT1OFFG</name>
              <description>XT1 Low Frequency Oscillator Fault Flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLULIFG</name>
              <description>FLL unlock interrupt flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENSTFCNT1</name>
              <description>Enable start counter for XT1</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLUNLOCK</name>
              <description>FLL unlock condition Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLUNLOCK_0</name>
                  <description>FLL unlock condition: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCK_1</name>
                  <description>FLL unlock condition: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCK_2</name>
                  <description>FLL unlock condition: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCK_3</name>
                  <description>FLL unlock condition: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLLUNLOCKHIS</name>
              <description>Unlock history Bit: 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_0</name>
                  <description>Unlock history: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_1</name>
                  <description>Unlock history: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_2</name>
                  <description>Unlock history: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FLLUNLOCKHIS_3</name>
                  <description>Unlock history: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FLLULPUC</name>
              <description>FLL unlock PUC enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLLWARNEN</name>
              <description>Warning enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSCTL8</name>
          <description>CS Control Register 8</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ACLKREQEN</name>
              <description>ACLK Clock Request Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MCLKREQEN</name>
              <description>MCLK Clock Request Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMCLKREQEN</name>
              <description>SMCLK Clock Request Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MODOSCREQEN</name>
              <description>MODOSC Clock Request Enable</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
