stianeklund/msp430fr4133/msp430fr4133.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>FRAM</name>
      <description>FRAM</description>
      <baseAddress>416</baseAddress>
      <registers>
        <register>
          <name>FRCTL0</name>
          <description>FRAM Controller Control 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>NWAITS</name>
              <description>FRAM Wait state control Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NWAITS_0</name>
                  <description>FRAM Wait state control: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_1</name>
                  <description>FRAM Wait state control: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_2</name>
                  <description>FRAM Wait state control: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_3</name>
                  <description>FRAM Wait state control: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_4</name>
                  <description>FRAM Wait state control: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_5</name>
                  <description>FRAM Wait state control: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_6</name>
                  <description>FRAM Wait state control: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NWAITS_7</name>
                  <description>FRAM Wait state control: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRCTLPW</name>
              <description>FRCTLPW password</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>GCCTL0</name>
          <description>General Control 0</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>FRLPMPWR</name>
              <description>FRAM Enable FRAM auto power up after LPM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FRPWR</name>
              <description>FRAM Power Control</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCTEIE</name>
              <description>RESERVED</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CBDIE</name>
              <description>Enable NMI event if correctable bit error detected</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBDIE</name>
              <description>Enable NMI event if uncorrectable bit error detected</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBDRSTEN</name>
              <description>Enable Power Up Clear (PUC) reset if FRAM uncorrectable bit error detected</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GCCTL1</name>
          <description>General Control 1</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CBDIFG</name>
              <description>FRAM correctable bit error flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UBDIFG</name>
              <description>FRAM uncorrectable bit error flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ACCTEIFG</name>
              <description>Access time error flag</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CRC16</name>
      <description>CRC16</description>
      <baseAddress>448</baseAddress>
      <registers>
        <register>
          <name>CRCDI</name>
          <description>CRC Data In Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>CRCDIRB</name>
          <description>CRC data in reverse byte Register</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>CRCINIRES</name>
          <description>CRC Initialisation Register and Result Register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>CRCRESR</name>
          <description>CRC reverse result Register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
