stianeklund/msp430fr4133/msp430fr4133.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>WATCHDOG_TIMER</name>
      <description>Watchdog Timer</description>
      <baseAddress>460</baseAddress>
      <registers>
        <register>
          <name>WDTCTL</name>
          <description>Watchdog Timer Control</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>WDTIS</name>
              <description>WDT - Timer Interval Select 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTIS_0</name>
                  <description>WDT - Timer Interval Select: /2G</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_1</name>
                  <description>WDT - Timer Interval Select: /128M</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_2</name>
                  <description>WDT - Timer Interval Select: /8192k</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_3</name>
                  <description>WDT - Timer Interval Select: /512k</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_4</name>
                  <description>WDT - Timer Interval Select: /32k</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_5</name>
                  <description>WDT - Timer Interval Select: /8192</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_6</name>
                  <description>WDT - Timer Interval Select: /512</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTIS_7</name>
                  <description>WDT - Timer Interval Select: /64</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTCNTCL</name>
              <description>WDT - Timer Clear</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTTMSEL</name>
              <description>WDT - Timer Mode Select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTSSEL</name>
              <description>WDT - Timer Clock Source Select 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>WDTSSEL_0</name>
                  <description>WDT - Timer Clock Source Select: SMCLK</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_1</name>
                  <description>WDT - Timer Clock Source Select: ACLK</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_2</name>
                  <description>WDT - Timer Clock Source Select: VLO_CLK</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WDTSSEL_3</name>
                  <description>WDT - Timer Clock Source Select: reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>WDTHOLD</name>
              <description>WDT - Timer hold</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WDTPW</name>
              <description>Watchdog timer password</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>CAPACITIVE_TOUCH_IO_0</name>
      <description>Capacitive_Touch_IO 0</description>
      <baseAddress>750</baseAddress>
      <registers>
        <register>
          <name>CAPTIO0CTL</name>
          <description>Capacitive_Touch_IO 0 control register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>CAPTIOPISEL0</name>
              <description>CapTouchIO Pin Select Bit: 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPISEL1</name>
              <description>CapTouchIO Pin Select Bit: 1</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPISEL2</name>
              <description>CapTouchIO Pin Select Bit: 2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPOSEL0</name>
              <description>CapTouchIO Port Select Bit: 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPOSEL1</name>
              <description>CapTouchIO Port Select Bit: 1</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPOSEL2</name>
              <description>CapTouchIO Port Select Bit: 2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOPOSEL3</name>
              <description>CapTouchIO Port Select Bit: 3</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIOEN</name>
              <description>CapTouchIO Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CAPTIO</name>
              <description>CapTouchIO state</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
