stianeklund/msp430fr4133/msp430fr4133.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>REAL_TIME_CLOCK</name>
      <description>Real-Time Clock</description>
      <baseAddress>960</baseAddress>
      <registers>
        <register>
          <name>RTCCTL</name>
          <description>RTC control Register</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>RTCIF</name>
              <description>Low-Power-Counter Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCIE</name>
              <description>Low-Power-Counter Interrupt Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCSR</name>
              <description>Low-Power-Counter Software Reset</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTCPS</name>
              <description>Low-Power-Counter Clock Pre-divider Select Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCPS_0</name>
                  <description>Low-Power-Counter Clock Pre-divider Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCPS_1</name>
                  <description>Low-Power-Counter Clock Pre-divider Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCPS_2</name>
                  <description>Low-Power-Counter Clock Pre-divider Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCPS_3</name>
                  <description>Low-Power-Counter Clock Pre-divider Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCPS_4</name>
                  <description>Low-Power-Counter Clock Pre-divider Select: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCPS_5</name>
                  <description>Low-Power-Counter Clock Pre-divider Select: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCPS_6</name>
                  <description>Low-Power-Counter Clock Pre-divider Select: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCPS_7</name>
                  <description>Low-Power-Counter Clock Pre-divider Select: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RTCSS</name>
              <description>Low-Power-Counter Clock Source Select Bit: 0</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RTCSS_0</name>
                  <description>Low-Power-Counter Clock Source Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCSS_1</name>
                  <description>Low-Power-Counter Clock Source Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCSS_2</name>
                  <description>Low-Power-Counter Clock Source Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RTCSS_3</name>
                  <description>Low-Power-Counter Clock Source Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>RTCIV</name>
          <description>RTC interrupt vector</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RTCMOD</name>
          <description>RTC moduloRegister</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>RTCCNT</name>
          <description>RTC counter Register</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>LCD_E</name>
      <description>LCD_E</description>
      <baseAddress>1536</baseAddress>
      <registers>
        <register>
          <name>LCDCTL0</name>
          <description>LCD_E Control Register 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDON</name>
              <description>LCD_E LCD On</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDLP</name>
              <description>LCD_E Low Power Waveform</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDSON</name>
              <description>LCD_E LCD Segments On</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDMX0</name>
              <description>LCD_E Mux Rate Bit: 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDMX1</name>
              <description>LCD_E Mux Rate Bit: 1</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDMX2</name>
              <description>LCD_E Mux Rate Bit: 2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDSSEL</name>
              <description>LCD_E Clock Select Bit: 0</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDSSEL_0</name>
                  <description>LCD_E Clock Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDSSEL_1</name>
                  <description>LCD_E Clock Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDSSEL_2</name>
                  <description>LCD_E Clock Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDSSEL_3</name>
                  <description>LCD_E Clock Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDDIV</name>
              <description>LCD_E LCD frequency divider Bit: 0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDDIV_0</name>
                  <description>LCD_E LCD frequency divider: /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_1</name>
                  <description>LCD_E LCD frequency divider: /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_2</name>
                  <description>LCD_E LCD frequency divider: /3</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_3</name>
                  <description>LCD_E LCD frequency divider: /4</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_4</name>
                  <description>LCD_E LCD frequency divider: /5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_5</name>
                  <description>LCD_E LCD frequency divider: /6</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_6</name>
                  <description>LCD_E LCD frequency divider: /7</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_7</name>
                  <description>LCD_E LCD frequency divider: /8</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_8</name>
                  <description>LCD_E LCD frequency divider: /9</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_9</name>
                  <description>LCD_E LCD frequency divider: /10</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_10</name>
                  <description>LCD_E LCD frequency divider: /11</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_11</name>
                  <description>LCD_E LCD frequency divider: /12</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_12</name>
                  <description>LCD_E LCD frequency divider: /13</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_13</name>
                  <description>LCD_E LCD frequency divider: /14</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_14</name>
                  <description>LCD_E LCD frequency divider: /15</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_15</name>
                  <description>LCD_E LCD frequency divider: /16</description>
                  <value>15</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_16</name>
                  <description>LCD_E LCD frequency divider: /17</description>
                  <value>16</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_17</name>
                  <description>LCD_E LCD frequency divider: /18</description>
                  <value>17</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_18</name>
                  <description>LCD_E LCD frequency divider: /19</description>
                  <value>18</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_19</name>
                  <description>LCD_E LCD frequency divider: /20</description>
                  <value>19</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_20</name>
                  <description>LCD_E LCD frequency divider: /21</description>
                  <value>20</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_21</name>
                  <description>LCD_E LCD frequency divider: /22</description>
                  <value>21</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_22</name>
                  <description>LCD_E LCD frequency divider: /23</description>
                  <value>22</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_23</name>
                  <description>LCD_E LCD frequency divider: /24</description>
                  <value>23</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_24</name>
                  <description>LCD_E LCD frequency divider: /25</description>
                  <value>24</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_25</name>
                  <description>LCD_E LCD frequency divider: /26</description>
                  <value>25</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_26</name>
                  <description>LCD_E LCD frequency divider: /27</description>
                  <value>26</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_27</name>
                  <description>LCD_E LCD frequency divider: /28</description>
                  <value>27</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_28</name>
                  <description>LCD_E LCD frequency divider: /29</description>
                  <value>28</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_29</name>
                  <description>LCD_E LCD frequency divider: /30</description>
                  <value>29</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_30</name>
                  <description>LCD_E LCD frequency divider: /31</description>
                  <value>30</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDDIV_31</name>
                  <description>LCD_E LCD frequency divider: /32</description>
                  <value>31</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDCTL1</name>
          <description>LCD_E Control Register 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDFRMIFG</name>
              <description>LCD_E LCD frame interrupt flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDBLKOFFIFG</name>
              <description>LCD_E LCD blinking off interrupt flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDBLKONIFG</name>
              <description>LCD_E LCD blinking on interrupt flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDFRMIE</name>
              <description>LCD_E LCD frame interrupt enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDBLKOFFIE</name>
              <description>LCD_E LCD blinking off interrupt flag</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDBLKONIE</name>
              <description>LCD_E LCD blinking on interrupt flag</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDBLKCTL</name>
          <description>LCD_E blinking control register</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDBLKMOD</name>
              <description>LCD_E Blinking mode Bit: 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDBLKMOD_0</name>
                  <description>LCD_E Blinking mode: Off</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKMOD_1</name>
                  <description>LCD_E Blinking mode: Individual</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKMOD_2</name>
                  <description>LCD_E Blinking mode: All</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKMOD_3</name>
                  <description>LCD_E Blinking mode: Switching</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LCDBLKPRE</name>
              <description>LCD_E Clock pre-scaler for blinking frequency Bit: 0</description>
              <bitOffset>2</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LCDBLKPRE_0</name>
                  <description>LCD_E Clock pre-scaler for blinking frequency: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_1</name>
                  <description>LCD_E Clock pre-scaler for blinking frequency: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_2</name>
                  <description>LCD_E Clock pre-scaler for blinking frequency: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_3</name>
                  <description>LCD_E Clock pre-scaler for blinking frequency: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_4</name>
                  <description>LCD_E Clock pre-scaler for blinking frequency: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_5</name>
                  <description>LCD_E Clock pre-scaler for blinking frequency: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_6</name>
                  <description>LCD_E Clock pre-scaler for blinking frequency: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LCDBLKPRE_7</name>
                  <description>LCD_E Clock pre-scaler for blinking frequency: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>LCDMEMCTL</name>
          <description>LCD_E memory control register</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDDISP</name>
              <description>LCD_E LCD memory registers for display</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCLRM</name>
              <description>LCD_E Clear LCD memory</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCLRBM</name>
              <description>LCD_E Clear LCD blinking memory</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
