stianeklund/msp430fr4133/msp430fr4133.svd
        <register>
          <name>LCDCSSEL0</name>
          <description>LCD_E COM/SEG select register 0</description>
          <addressOffset>20</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDCSS0</name>
              <description>Selects pin L0  as either common or segment line</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS1</name>
              <description>Selects pin L1  as either common or segment line</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS2</name>
              <description>Selects pin L2  as either common or segment line</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS3</name>
              <description>Selects pin L3  as either common or segment line</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS4</name>
              <description>Selects pin L4  as either common or segment line</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS5</name>
              <description>Selects pin L5  as either common or segment line</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS6</name>
              <description>Selects pin L6  as either common or segment line</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS7</name>
              <description>Selects pin L7  as either common or segment line</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS8</name>
              <description>Selects pin L8  as either common or segment line</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS9</name>
              <description>Selects pin L9  as either common or segment line</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS10</name>
              <description>Selects pin L10 as either common or segment line</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS11</name>
              <description>Selects pin L11 as either common or segment line</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS12</name>
              <description>Selects pin L12 as either common or segment line</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS13</name>
              <description>Selects pin L13 as either common or segment line</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS14</name>
              <description>Selects pin L14 as either common or segment line</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS15</name>
              <description>Selects pin L15 as either common or segment line</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDCSSEL1</name>
          <description>LCD_E COM/SEG select register 1</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDCSS16</name>
              <description>Selects pin L16 as either common or segment line</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS17</name>
              <description>Selects pin L17 as either common or segment line</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS18</name>
              <description>Selects pin L18 as either common or segment line</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS19</name>
              <description>Selects pin L19 as either common or segment line</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS20</name>
              <description>Selects pin L20 as either common or segment line</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS21</name>
              <description>Selects pin L21 as either common or segment line</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS22</name>
              <description>Selects pin L22 as either common or segment line</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS23</name>
              <description>Selects pin L23 as either common or segment line</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS24</name>
              <description>Selects pin L24 as either common or segment line</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS25</name>
              <description>Selects pin L25 as either common or segment line</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS26</name>
              <description>Selects pin L26 as either common or segment line</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS27</name>
              <description>Selects pin L27 as either common or segment line</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS28</name>
              <description>Selects pin L28 as either common or segment line</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS29</name>
              <description>Selects pin L29 as either common or segment line</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS30</name>
              <description>Selects pin L30 as either common or segment line</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS31</name>
              <description>Selects pin L31 as either common or segment line</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDCSSEL2</name>
          <description>LCD_E COM/SEG select register 2</description>
          <addressOffset>24</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>LCDCSS32</name>
              <description>Selects pin L32 as either common or segment line</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS33</name>
              <description>Selects pin L33 as either common or segment line</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS34</name>
              <description>Selects pin L34 as either common or segment line</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS35</name>
              <description>Selects pin L35 as either common or segment line</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS36</name>
              <description>Selects pin L36 as either common or segment line</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS37</name>
              <description>Selects pin L37 as either common or segment line</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS38</name>
              <description>Selects pin L38 as either common or segment line</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS39</name>
              <description>Selects pin L39 as either common or segment line</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS40</name>
              <description>Selects pin L40 as either common or segment line</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS41</name>
              <description>Selects pin L41 as either common or segment line</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS42</name>
              <description>Selects pin L42 as either common or segment line</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS43</name>
              <description>Selects pin L43 as either common or segment line</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS44</name>
              <description>Selects pin L44 as either common or segment line</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS45</name>
              <description>Selects pin L45 as either common or segment line</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS46</name>
              <description>Selects pin L46 as either common or segment line</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LCDCSS47</name>
              <description>Selects pin L47 as either common or segment line</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>65535</maximum>
            </range>
          </writeConstraint>
        </register>
        <register>
          <name>LCDIV</name>
          <description>LCD_E Interrupt Vector Register</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM0W</name>
          <description>LCD Memory 0/1</description>
          <addressOffset>32</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM2W</name>
          <description>LCD Memory 2/3</description>
          <addressOffset>34</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM4W</name>
          <description>LCD Memory 4/5</description>
          <addressOffset>36</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM6W</name>
          <description>LCD Memory 6/7</description>
          <addressOffset>38</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM8W</name>
          <description>LCD Memory 8/9</description>
          <addressOffset>40</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM10W</name>
          <description>LCD Memory 10/11</description>
          <addressOffset>42</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM12W</name>
          <description>LCD Memory 12/13</description>
          <addressOffset>44</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM14W</name>
          <description>LCD Memory 14/15</description>
          <addressOffset>46</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM16W</name>
          <description>LCD Memory 16/17</description>
          <addressOffset>48</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM18W</name>
          <description>LCD Memory 18/19</description>
          <addressOffset>50</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM20W</name>
          <description>LCD Memory 20/21</description>
          <addressOffset>52</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM22W</name>
          <description>LCD Memory 22/23</description>
          <addressOffset>54</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM24W</name>
          <description>LCD Memory 24/25</description>
          <addressOffset>56</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM26W</name>
          <description>LCD Memory 26/27</description>
          <addressOffset>58</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM28W</name>
          <description>LCD Memory 28/29</description>
          <addressOffset>60</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM30W</name>
          <description>LCD Memory 30/31</description>
          <addressOffset>62</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDBM0W</name>
          <description>LCD Blinking Memory 0/1</description>
          <addressOffset>64</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM32W</name>
          <description>LCD Memory 32/33</description>
          <addressOffset>64</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <alternateRegister>LCDBM0W</alternateRegister>
        </register>
        <register>
          <name>LCDBM2W</name>
          <description>LCD Blinking Memory 2/3</description>
          <addressOffset>66</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM34W</name>
          <description>LCD Memory 34/35</description>
          <addressOffset>66</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <alternateRegister>LCDBM2W</alternateRegister>
        </register>
        <register>
          <name>LCDBM4W</name>
          <description>LCD Blinking Memory 4/5</description>
          <addressOffset>68</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM36W</name>
          <description>LCD Memory 36/37</description>
          <addressOffset>68</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <alternateRegister>LCDBM4W</alternateRegister>
        </register>
        <register>
          <name>LCDBM6W</name>
          <description>LCD Blinking Memory 6/7</description>
          <addressOffset>70</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDM38W</name>
          <description>LCD Memory 38/39</description>
          <addressOffset>70</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <alternateRegister>LCDBM6W</alternateRegister>
        </register>
        <register>
          <name>LCDBM8W</name>
          <description>LCD Blinking Memory 8/9</description>
          <addressOffset>72</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDBM10W</name>
          <description>LCD Blinking Memory 10/11</description>
          <addressOffset>74</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDBM12W</name>
          <description>LCD Blinking Memory 12/13</description>
          <addressOffset>76</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDBM14W</name>
          <description>LCD Blinking Memory 14/15</description>
          <addressOffset>78</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDBM16W</name>
          <description>LCD Blinking Memory 16/17</description>
          <addressOffset>80</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>LCDBM18W</name>
          <description>LCD Blinking Memory 18/19</description>
          <addressOffset>82</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
