stianeklund/msp430fr4133/msp430fr4133.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BACKUP_MEMORY</name>
      <description>Backup Memory</description>
      <baseAddress>1632</baseAddress>
      <registers>
        <register>
          <name>BAKMEM0</name>
          <description>Battery Backup Memory 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM1</name>
          <description>Battery Backup Memory 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM2</name>
          <description>Battery Backup Memory 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM3</name>
          <description>Battery Backup Memory 3</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM4</name>
          <description>Battery Backup Memory 4</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM5</name>
          <description>Battery Backup Memory 5</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM6</name>
          <description>Battery Backup Memory 6</description>
          <addressOffset>12</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM7</name>
          <description>Battery Backup Memory 7</description>
          <addressOffset>14</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM8</name>
          <description>Battery Backup Memory 8</description>
          <addressOffset>16</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM9</name>
          <description>Battery Backup Memory 9</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM10</name>
          <description>Battery Backup Memory 10</description>
          <addressOffset>20</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM11</name>
          <description>Battery Backup Memory 11</description>
          <addressOffset>22</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM12</name>
          <description>Battery Backup Memory 12</description>
          <addressOffset>24</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM13</name>
          <description>Battery Backup Memory 13</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM14</name>
          <description>Battery Backup Memory 14</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>BAKMEM15</name>
          <description>Battery Backup Memory 15</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC</name>
      <description>ADC</description>
      <baseAddress>1792</baseAddress>
      <registers>
        <register>
          <name>ADCCTL0</name>
          <description>ADC Control 0</description>
          <addressOffset>0</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCSC</name>
              <description>ADC Start Conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCENC</name>
              <description>ADC Enable Conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCON</name>
              <description>ADC On/enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCMSC</name>
              <description>ADC Multiple SampleConversion</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSHT</name>
              <description>ADC Sample Hold Select Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSHT_0</name>
                  <description>ADC Sample Hold Select 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_1</name>
                  <description>ADC Sample Hold Select 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_2</name>
                  <description>ADC Sample Hold Select 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_3</name>
                  <description>ADC Sample Hold Select 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_4</name>
                  <description>ADC Sample Hold Select 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_5</name>
                  <description>ADC Sample Hold Select 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_6</name>
                  <description>ADC Sample Hold Select 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_7</name>
                  <description>ADC Sample Hold Select 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_8</name>
                  <description>ADC Sample Hold Select 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_9</name>
                  <description>ADC Sample Hold Select 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_10</name>
                  <description>ADC Sample Hold Select 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_11</name>
                  <description>ADC Sample Hold Select 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_12</name>
                  <description>ADC Sample Hold Select 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_13</name>
                  <description>ADC Sample Hold Select 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_14</name>
                  <description>ADC Sample Hold Select 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHT_15</name>
                  <description>ADC Sample Hold Select 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCTL1</name>
          <description>ADC Control 1</description>
          <addressOffset>2</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCBUSY</name>
              <description>ADC Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCCONSEQ</name>
              <description>ADC Conversion Sequence Select 0</description>
              <bitOffset>1</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCCONSEQ_0</name>
                  <description>ADC Conversion Sequence Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCCONSEQ_1</name>
                  <description>ADC Conversion Sequence Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCCONSEQ_2</name>
                  <description>ADC Conversion Sequence Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCCONSEQ_3</name>
                  <description>ADC Conversion Sequence Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSSEL</name>
              <description>ADC Clock Source Select 0</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSSEL_0</name>
                  <description>ADC Clock Source Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSSEL_1</name>
                  <description>ADC Clock Source Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSSEL_2</name>
                  <description>ADC Clock Source Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSSEL_3</name>
                  <description>ADC Clock Source Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCDIV</name>
              <description>ADC Clock Divider Select 0</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCDIV_0</name>
                  <description>ADC Clock Divider Select: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_1</name>
                  <description>ADC Clock Divider Select: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_2</name>
                  <description>ADC Clock Divider Select: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_3</name>
                  <description>ADC Clock Divider Select: 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_4</name>
                  <description>ADC Clock Divider Select: 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_5</name>
                  <description>ADC Clock Divider Select: 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_6</name>
                  <description>ADC Clock Divider Select: 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCDIV_7</name>
                  <description>ADC Clock Divider Select: 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCISSH</name>
              <description>ADC Invert Sample Hold Signal</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSHP</name>
              <description>ADC Sample/Hold Pulse Mode</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCSHS</name>
              <description>ADC Sample/Hold Source 0</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSHS_0</name>
                  <description>ADC Sample/Hold Source: 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHS_1</name>
                  <description>ADC Sample/Hold Source: 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHS_2</name>
                  <description>ADC Sample/Hold Source: 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSHS_3</name>
                  <description>ADC Sample/Hold Source: 3</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCCTL2</name>
          <description>ADC Control 2</description>
          <addressOffset>4</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCSR</name>
              <description>ADC Sampling Rate</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCDF</name>
              <description>ADC Data Format</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCRES</name>
              <description>ADC Resolution</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCRES_0</name>
                  <description>8 bit</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCRES_1</name>
                  <description>10 bit</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCRES_2</name>
                  <description>Reserved</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCRES_3</name>
                  <description>Reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCPDIV</name>
              <description>ADC predivider Bit: 0</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCPDIV_0</name>
                  <description>ADC predivider /1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPDIV_1</name>
                  <description>ADC predivider /2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPDIV_2</name>
                  <description>ADC predivider /64</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCPDIV_3</name>
                  <description>ADC predivider reserved</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCLO</name>
          <description>ADC Window Comparator High Threshold</description>
          <addressOffset>6</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADCHI</name>
          <description>ADC Window Comparator High Threshold</description>
          <addressOffset>8</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
