stianeklund/msp430fr4133/msp430fr4133.svd
        <register>
          <name>ADCMCTL0</name>
          <description>ADC Memory Control 0</description>
          <addressOffset>10</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCINCH</name>
              <description>ADC Input Channel Select Bit 0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCINCH_0</name>
                  <description>ADC Input Channel 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_1</name>
                  <description>ADC Input Channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_2</name>
                  <description>ADC Input Channel 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_3</name>
                  <description>ADC Input Channel 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_4</name>
                  <description>ADC Input Channel 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_5</name>
                  <description>ADC Input Channel 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_6</name>
                  <description>ADC Input Channel 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_7</name>
                  <description>ADC Input Channel 7</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_8</name>
                  <description>ADC Input Channel 8</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_9</name>
                  <description>ADC Input Channel 9</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_10</name>
                  <description>ADC Input Channel 10</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_11</name>
                  <description>ADC Input Channel 11</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_12</name>
                  <description>ADC Input Channel 12</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_13</name>
                  <description>ADC Input Channel 13</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_14</name>
                  <description>ADC Input Channel 14</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCINCH_15</name>
                  <description>ADC Input Channel 15</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSREF</name>
              <description>ADC Select Reference Bit 0</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADCSREF_0</name>
                  <description>ADC Select Reference 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_1</name>
                  <description>ADC Select Reference 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_2</name>
                  <description>ADC Select Reference 2</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_3</name>
                  <description>ADC Select Reference 3</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_4</name>
                  <description>ADC Select Reference 4</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_5</name>
                  <description>ADC Select Reference 5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_6</name>
                  <description>ADC Select Reference 6</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADCSREF_7</name>
                  <description>ADC Select Reference 7</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCMEM0</name>
          <description>ADC Conversion Memory 0</description>
          <addressOffset>18</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
        <register>
          <name>ADCIE</name>
          <description>ADC Interrupt Enable</description>
          <addressOffset>26</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCIE0</name>
              <description>ADC Interrupt enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCINIE</name>
              <description>ADC Interrupt enable for the inside of window of the Window comparator</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCLOIE</name>
              <description>ADC Interrupt enable for lower threshold of the Window comparator</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCHIIE</name>
              <description>ADC Interrupt enable for upper threshold of the Window comparator</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCOVIE</name>
              <description>ADC ADCMEM overflow Interrupt enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCTOVIE</name>
              <description>ADC conversion-time-overflow Interrupt enable</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCIFG</name>
          <description>ADC Interrupt Flag</description>
          <addressOffset>28</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADCIFG0</name>
              <description>ADC Interrupt Flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCINIFG</name>
              <description>ADC Interrupt Flag for the inside of window of the Window comparator</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCLOIFG</name>
              <description>ADC Interrupt Flag for lower threshold of the Window comparator</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCHIIFG</name>
              <description>ADC Interrupt Flag for upper threshold of the Window comparator</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCOVIFG</name>
              <description>ADC ADCMEM overflow Interrupt Flag</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADCTOVIFG</name>
              <description>ADC conversion-time-overflow Interrupt Flag</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADCIV</name>
          <description>ADC Interrupt Vector Word</description>
          <addressOffset>30</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
        </register>
