stianeklund/msp430fr4133/msp430fr4133.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>_INTERRUPTS</name>
      <baseAddress>65408</baseAddress>
      <interrupt>
        <name>LCD_E</name>
        <description>0xFFE2 LCD E</description>
        <value>45</value>
      </interrupt>
      <interrupt>
        <name>PORT2</name>
        <description>0xFFE4 Port 2</description>
        <value>46</value>
      </interrupt>
      <interrupt>
        <name>PORT1</name>
        <description>0xFFE6 Port 1</description>
        <value>47</value>
      </interrupt>
      <interrupt>
        <name>ADC</name>
        <description>0xFFE8 ADC</description>
        <value>48</value>
      </interrupt>
      <interrupt>
        <name>USCI_B0</name>
        <description>0xFFEA USCI B0 Receive/Transmit</description>
        <value>49</value>
      </interrupt>
      <interrupt>
        <name>USCI_A0</name>
        <description>0xFFEC USCI A0 Receive/Transmit</description>
        <value>50</value>
      </interrupt>
      <interrupt>
        <name>WDT</name>
        <description>0xFFEE Watchdog Timer</description>
        <value>51</value>
      </interrupt>
      <interrupt>
        <name>RTC</name>
        <description>0xFFF0 RTC</description>
        <value>52</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A1</name>
        <description>0xFFF2 Timer1_A3 CC1-2, TA</description>
        <value>53</value>
      </interrupt>
      <interrupt>
        <name>TIMER1_A0</name>
        <description>0xFFF4 Timer1_A3 CC0</description>
        <value>54</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A1</name>
        <description>0xFFF6 Timer0_A3 CC1-2, TA</description>
        <value>55</value>
      </interrupt>
      <interrupt>
        <name>TIMER0_A0</name>
        <description>0xFFE8 Timer0_A3 CC0</description>
        <value>56</value>
      </interrupt>
      <interrupt>
        <name>UNMI</name>
        <description>0xFFFA User Non-maskable</description>
        <value>57</value>
      </interrupt>
      <interrupt>
        <name>SYSNMI</name>
        <description>0xFFFC System Non-maskable</description>
        <value>58</value>
      </interrupt>
    </peripheral>
  </peripherals>
</device>
